==================
Augmented assignment operators
==================

$x += 5;
$x -= 3;
$x *= 2;
$x /= 4;
$x %= 3;
$x **= 2;
$x &= 0xFF;
$x |= 0x10;
$x ^= 0xAA;
$x <<= 2;
$x >>= 1;

---

(source_file
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (assignment_expression (variable) (number))))

==================
String augmented assignment
==================

$str .= "append";
$str x= 3;
$str =~ s/old/new/;
$str !~ /pattern/;

---

(source_file
  (expression_statement (assignment_expression (variable) (string)))
  (expression_statement (assignment_expression (variable) (number)))
  (expression_statement (binary_expression (variable) (substitution)))
  (expression_statement (binary_expression (variable) (regex))))

==================
Logical augmented assignment
==================

$x ||= "default";
$x &&= validate();
$x //= "defined-or-default";

---

(source_file
  (expression_statement (assignment_expression (variable) (string)))
  (expression_statement (assignment_expression (variable) (call_expression (identifier) (argument_list))))
  (expression_statement (assignment_expression (variable) (string))))

==================
Yada yada operator
==================

sub todo { ... }
sub stub() { ... }
if ($condition) {
    ...;
}
... if $debug;

---

(source_file
  (subroutine_declaration (identifier) (block (expression_statement (yada_yada))))
  (subroutine_declaration (identifier) (prototype) (block (expression_statement (yada_yada))))
  (if_statement (parenthesized_expression (variable)) (block (expression_statement (yada_yada))))
  (expression_statement (statement_modifier (yada_yada) (variable))))

==================
Assignment to special forms
==================

substr($str, 0, 5) = "HELLO";
vec($bits, 3, 8) = 255;
pos($str) = 10;
$hash{key} //= "default";
$array[5] ||= [];

---

(source_file
  (expression_statement (assignment_expression (call_expression (identifier) (argument_list (variable) (number) (number))) (string)))
  (expression_statement (assignment_expression (call_expression (identifier) (argument_list (variable) (number) (number))) (number)))
  (expression_statement (assignment_expression (call_expression (identifier) (argument_list (variable))) (number)))
  (expression_statement (assignment_expression (hash_element (variable) (identifier)) (string)))
  (expression_statement (assignment_expression (array_element (variable) (number)) (array_ref))))

==================
Chained assignments
==================

$a = $b = $c = 0;
($x, $y, $z) = (1, 2, 3);
@a[0..2] = ('a', 'b', 'c');
@hash{qw(k1 k2 k3)} = (1, 2, 3);

---

(source_file
  (expression_statement (assignment_expression (variable) (assignment_expression (variable) (assignment_expression (variable) (number)))))
  (expression_statement (assignment_expression (list (variable) (variable) (variable)) (list (number) (number) (number))))
  (expression_statement (assignment_expression (array_slice (variable) (range (number) (number))) (list (string) (string) (string))))
  (expression_statement (assignment_expression (hash_slice (variable) (qw_list)) (list (number) (number) (number)))))

==================
Local and my with assignment
==================

local $/ = undef;
local $\ = "\n";
local $| = 1;
my $x //= 5;
our $VERSION ||= '0.01';
state $count //= 0;

---

(source_file
  (expression_statement (local_declaration (special_variable) (undef)))
  (expression_statement (local_declaration (special_variable) (string)))
  (expression_statement (local_declaration (special_variable) (number)))
  (expression_statement (my_declaration (variable) (number)))
  (expression_statement (our_declaration (variable) (string)))
  (expression_statement (state_declaration (variable) (number))))