==================
List range operator
==================
# @id: range.list.001  
# @tags: range list array
# @perl: 5.8+

my @digits = 0..9;
my @letters = 'a'..'z';
my @mixed = (1..5, 10..15);
@array[2..5] = ('a'..'d');

---

(source_file
  (expression_statement (my_declaration (variable) (range (number) (number))))
  (expression_statement (my_declaration (variable) (range (string) (string))))
  (expression_statement (my_declaration (variable) (list (range (number) (number)) (range (number) (number)))))
  (expression_statement (assignment_expression (array_slice (variable) (range (number) (number))) (range (string) (string)))))

==================
Boolean flip flop operator
==================
# @id: range.flipflop.001  
# @tags: range flipflop boolean scalar-context
# @perl: 5.8+
# @flags: precedence

if ($. == 1 .. $. == 10) {
    push @header, $_;
}
print if 3..5;

---

(source_file
  (if_statement (parenthesized_expression (range 
    (binary_expression (special_variable) (number))
    (binary_expression (special_variable) (number))))
    (block (expression_statement (call_expression (identifier) (variable) (special_variable)))))
  (expression_statement (statement_modifier (call_expression (identifier)) (range (number) (number)))))

==================
Exclusive flip flop three dots
==================
# @id: range.flipflop.exclusive.001  
# @tags: range flipflop ellipsis exclusive
# @perl: 5.12+

if (/^BEGIN/ ... /^END/) {
    push @block, $_;
}
next if 1...10;

---

(source_file
  (if_statement (parenthesized_expression (range (regex) (regex))) (block
    (expression_statement (call_expression (identifier) (variable) (special_variable)))))
  (expression_statement (statement_modifier (call_expression (identifier)) (range (number) (number)))))

==================
Flip flop with E suffix
==================
# @id: range.flipflop.e.001  
# @tags: range flipflop E-suffix terminal
# @perl: 5.8+

if (/start/ .. /end/E) {
    process($_);
}

---

(source_file
  (if_statement (parenthesized_expression (range (regex) (regex))) (block
    (expression_statement (call_expression (identifier) (argument_list (special_variable)))))))

==================
Range in different contexts
==================
# @id: range.context.001  
# @tags: range context list scalar
# @perl: 5.8+

my $scalar = (1..10);
my @list = (1..10);
for (1..10) { print }
print 1..10;

---

(source_file
  (expression_statement (my_declaration (variable) (parenthesized_expression (range (number) (number)))))
  (expression_statement (my_declaration (variable) (range (number) (number))))
  (for_statement (parenthesized_expression (range (number) (number))) (block (expression_statement (call_expression (identifier)))))
  (expression_statement (call_expression (identifier) (range (number) (number)))))

==================
Complex flip flop conditions
==================
# @id: range.flipflop.complex.001  
# @tags: range flipflop complex-conditions
# @perl: 5.8+

while (<DATA>) {
    if (((/^=head1/ and $. == 1) or /^=cut/) .. /^=head1/) {
        push @pod, $_;
    }
}

---

(source_file
  (while_statement (parenthesized_expression (readline (identifier))) (block
    (if_statement (parenthesized_expression (range 
      (parenthesized_expression (binary_expression 
        (parenthesized_expression (binary_expression (regex) (binary_expression (special_variable) (number))))
        (regex)))
      (regex)))
      (block (expression_statement (call_expression (identifier) (variable) (special_variable))))))))

==================
Flip flop vs range precedence
==================
# @id: range.precedence.001  
# @tags: range flipflop precedence
# @perl: 5.8+
# @flags: precedence ambiguous

my @a = $x == 1 .. $y == 10;
my $b = $x == 1 .. $y == 10;
print if $start .. $end && $enabled;

---

(source_file
  (expression_statement (my_declaration (variable) (range 
    (binary_expression (variable) (number))
    (binary_expression (variable) (number)))))
  (expression_statement (my_declaration (variable) (range 
    (binary_expression (variable) (number))
    (binary_expression (variable) (number)))))
  (expression_statement (statement_modifier (call_expression (identifier)) 
    (binary_expression (range (variable) (variable)) (variable)))))
