==================
Format with continuations
==================

format STDOUT =
Name: @<<<<<<<<<<< Age: @### Score: @##.##
$name, $age, $score
Address: @<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$address
~~       ^<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$address
.

format REPORT =
@|||||||||||||||||||||||||||||||||||||||||
$title
@<<<<<<<<<< @|||||||||| @>>>>>>>>>>
$left, $center, $right
~~^<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$text
.

---

(source_file
  (format_declaration)
  (format_declaration))

==================
Dynamic format names
==================

format =
Dynamic format
.

my $format_name = "MYFORMAT";
format MYFORMAT =
@<<<<<<<<<< @>>>>>>>>>>
$field1, $field2
.

eval "format ${format_name}_TOP =
Header line
.
";

select((select(REPORT), $~ = "MYFORMAT")[0]);

---

(source_file
  (format_declaration)
  (statement)
  (format_declaration)
  (eval_statement)
  (statement))

==================
Complex format expressions
==================

format COMPLEX =
@<<<<<<<<< @####.## @>>>>>>>>
$name, calculate_value($x, $y), format_date($date)
@*
join(", ", @items)
^||||||||||||||||||||||||||||||||||||||||
substr($long_text, 0, 40)
~~^||||||||||||||||||||||||||||||||||||||
$long_text
.

format DATA =
@>>> @<<< @||| @### @###.##
$a || "N/A", $b // "-", $c eq "" ? "empty" : $c, $d + 0, $e * 100
.

---

(source_file
  (format_declaration)
  (format_declaration))

========================================
   Name            Age    Score
========================================
.

format REPORT =
@<<<<<<<<<<<<<< @### @###.##
$name, $age, $score
.

$^ = "REPORT_TOP";
$~ = "REPORT";

---

(source_file
  (format_declaration)
  (format_declaration)
  (statement)
  (statement))

==================
Numeric format fields
==================

format NUMBERS =
Integer:     @#####
$integer
Decimal:     @###.##
$decimal
Scientific:  @##.###^^^^
$scientific
Percent:     @##.#%
$percent * 100
Binary:      @########
sprintf("%b", $binary)
Hex:         @>>>>>>>>
sprintf("0x%X", $hex)
.

---

(source_file
  (format_declaration))

==================
Format with special variables
==================

format SPECIAL =
Page: @### of @###  Lines: @####
$%, $max_pages, $.
File: @<<<<<<<<<<<<<<<<<<<<<<< PID: @#####
$ARGV, $$
User: @<<<<<<<<<< Time: @<<<<<<<<<<<<<<<<<
$ENV{USER}, scalar(localtime)
.

format_lines_per_page STDOUT, 50;
format_top_name STDOUT, "STDOUT_TOP";
format_line_break_characters STDOUT, "-\n";

---

(source_file
  (format_declaration)
  (statement)
  (statement)
  (statement))

==================
Format with filehandles
==================

format FILE_FORMAT =
@<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$_
.

open my $fh, '>', 'output.txt';
my $old = select($fh);
$~ = "FILE_FORMAT";

write;

select($old);
close $fh;

format_name $fh, "FILE_FORMAT";
format_top_name $fh, "FILE_TOP";

---

(source_file
  (format_declaration)
  (statement)
  (statement)
  (statement)
  (statement)
  (statement)
  (statement)
  (statement)
  (statement))

==================
Multiline format fields
==================

format MULTILINE =
Description:
^<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$description
~~^<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$description
Notes:
@*
$notes
Comments:
^*
join("\n", @comments)
.

---

(source_file
  (format_declaration))

==================
Format with picture lines
==================

format PICTURE =
+----------+----------+----------+
| @<<<<<<< | @<<<<<<< | @<<<<<<< |
  $col1,     $col2,     $col3
+----------+----------+----------+
| @||||||| | @####### | @>>>>>>> |
  $data1,    $data2,    $data3
+----------+----------+----------+
.

format BOXES =
+==================+
| @|||||||||||||||| |
  $title
+==================+
| @<<<<<<<<<<<<<< |
  $content
+------------------+
.

---

(source_file
  (format_declaration)
  (format_declaration))

==================
Format write and formline
==================

local $~ = "MYFORMAT";
write;

write FILEHANDLE;

formline <<'END', @values;
@<<<< @>>>> @||||
END

my $picture = '@<<<< @>>>>';
formline $picture, $left, $right;
my $result = $^A;
$^A = "";

swrite(<<'END', $name, $value);
Name: @<<<<<<<<< Value: @>>>>
END

sub swrite {
    my $format = shift;
    $^A = "";
    formline($format, @_);
    return $^A;
}

---

(source_file
  (expression_statement
    (assignment_expression
      (localization_expression
        (scalar
          (varname)))
      (interpolated_string_literal
        (string_content))))
  (expression_statement
    (func1op_call_expression))
  (expression_statement
    (func1op_call_expression
      (bareword)))
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (list_expression
        (heredoc_token)
        (array
          (varname)))))
  (heredoc_content
    (heredoc_end))
  (expression_statement
    (assignment_expression
      (variable_declaration
        (scalar
          (varname)))
      (string_literal
        (string_content))))
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (list_expression
        (scalar
          (varname))
        (scalar
          (varname))
        (scalar
          (varname)))))
  (expression_statement
    (assignment_expression
      (variable_declaration
        (scalar
          (varname)))
      (scalar
        (varname))))
  (expression_statement
    (assignment_expression
      (scalar
        (varname))
      (interpolated_string_literal)))
  (expression_statement
    (function_call_expression
      (function)
      (list_expression
        (heredoc_token)
        (scalar
          (varname))
        (scalar
          (varname)))))
  (heredoc_content
    (heredoc_end))
  (subroutine_declaration_statement
    (bareword)
    (block
      (expression_statement
        (assignment_expression
          (variable_declaration
            (scalar
              (varname)))
          (func1op_call_expression)))
      (expression_statement
        (assignment_expression
          (scalar
            (varname))
          (interpolated_string_literal)))
      (expression_statement
        (function_call_expression
          (function)
          (list_expression
            (scalar
              (varname))
            (array
              (varname)))))
      (expression_statement
        (return_expression
          (scalar
            (varname)))))))
