==========================================
Multiple heredocs on one line
==========================================

print <<EOF, <<'END', <<"DONE";
First heredoc
with $interpolation
EOF
Second heredoc
no interpolation
END
Third heredoc
also with $interpolation
DONE

---

(source_file
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (list_expression
        (heredoc_token)
        (heredoc_token)
        (heredoc_token))))
  (heredoc_content
    (scalar
      (varname))
    (scalar
      (varname))
    (heredoc_end)))

==========================================
Heredocs in list context
==========================================

@array = (<<EOF, "string", <<'END');
First element
$interpolated
EOF
Last element
not $interpolated
END

---

(source_file
  (expression_statement
    (assignment_expression
      (array
        (varname))
      (list_expression
        (heredoc_token)
        (interpolated_string_literal
          (string_content))
        (heredoc_token))))
  (heredoc_content
    (heredoc_end)))

==========================================
Heredocs with method calls
==========================================

$obj->method(<<EOF);
Method argument
as heredoc
EOF

$result = $obj->process(<<'DATA')->trim;
Raw data
for processing
DATA

---

(source_file
  (expression_statement
    (method_call_expression
      (scalar
        (varname))
      (method)
      (heredoc_token)))
  (heredoc_content
    (heredoc_end))
  (expression_statement
    (assignment_expression
      (scalar
        (varname))
      (method_call_expression
        (method_call_expression
          (scalar
            (varname))
          (method)
          (heredoc_token))
        (method))))
  (heredoc_content
    (heredoc_end)))

==========================================
Heredocs in complex expressions
==========================================

$x = 5 + <<EOF =~ s/\d+/10/r;
The number is 42
EOF

if (<<EOF eq <<'END') {
test string
EOF
test string
END
    print "match\n";
}

---

(source_file
  (expression_statement
    (assignment_expression
      (scalar
        (varname))
      (binary_expression
        (number)
        (binary_expression
          (heredoc_token)
          (substitution_regexp
            (regexp_content
              (escape_sequence))
            (replacement)
            (substitution_regexp_modifiers))))))
  (heredoc_content
    (heredoc_end))
  (conditional_statement
    (equality_expression
      (heredoc_token)
      (heredoc_token))
    (block
      (heredoc_content
        (heredoc_end))
      (expression_statement
        (ambiguous_function_call_expression
          (function)
          (interpolated_string_literal
            (string_content
              (escape_sequence))))))))

==========================================
Heredocs with special delimiters
==========================================

print <<\EOF;
Backslashed delimiter
no $interpolation
EOF

print <<'';
Empty delimiter
on next line

print <<"END_${var}_TEXT";
Dynamic delimiter
with $interpolation
END_${var}_TEXT

---

(source_file
  (func1op_call_expression
    (identifier)
    (heredoc
      (heredoc_start_identifier)))
  (heredoc_content)
  (func1op_call_expression
    (identifier)
    (heredoc
      (heredoc_start_identifier)))
  (heredoc_content)
  (func1op_call_expression
    (identifier)
    (heredoc
      (heredoc_start_identifier)))
  (heredoc_content))

==========================================
Indented heredocs (Perl 5.26+)
==========================================

if (1) {
    print <<~EOF;
    This text
    is indented
    consistently
    EOF
}

$code = <<~'CODE';
    sub example {
        return 42;
    }
    CODE

---

(source_file
  (conditional_statement
    (number)
    (block
      (expression_statement
        (ambiguous_function_call_expression
          (function)
          (heredoc_token)))
      (heredoc_content
        (heredoc_end))))
  (expression_statement
    (assignment_expression
      (scalar
        (varname))
      (heredoc_token)))
  (heredoc_content
    (heredoc_end)))

==========================================
Heredocs with interpolation edge cases
==========================================

print <<"EOF";
Array: @{[ map { $_ * 2 } 1..5 ]}
Hash: ${\( $hash{key} )}
Code: @{[ do { local $" = ', '; "@array" } ]}
Special: ${^GLOBAL_PHASE}
EOF

---

(source_file
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (heredoc_token)))
  (heredoc_content
    (array
      (block
        (expression_statement
          (anonymous_array_expression
            (map_grep_expression
              (block
                (expression_statement
                  (binary_expression
                    (scalar
                      (varname))
                    (number))))
              (binary_expression
                (number)
                (number)))))))
    (scalar
      (block
        (expression_statement
          (refgen_expression
            (hash_element_expression
              (container_variable
                (varname))
              (autoquoted_bareword))))))
    (array
      (block
        (expression_statement
          (anonymous_array_expression
            (do_expression
              (block
                (expression_statement
                  (assignment_expression
                    (localization_expression
                      (scalar
                        (varname)))
                    (string_literal
                      (string_content))))
                (expression_statement
                  (interpolated_string_literal
                    (string_content
                      (array
                        (varname)))))))))))
    (scalar
      (varname))
    (heredoc_end)))

==========================================
Command heredocs
==========================================

$output = <<`SHELL`;
ls -la
date
SHELL

system(<<`END`);
echo "Running command"
pwd
END

---

(source_file
  (expression_statement
    (assignment_expression
      (scalar
        (varname))
      (command_heredoc_token)))
  (heredoc_content
    (heredoc_end))
  (expression_statement
    (function_call_expression
      (function)
      (command_heredoc_token)))
  (heredoc_content
    (heredoc_end)))

==========================================
Nested heredoc-like structures
==========================================

print <<EOF;
This contains what looks like <<INNER
but it's just text
INNER
not a real heredoc
EOF

$regex = qr/<<(\w+).*?\n\1/s;

---

(source_file
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (heredoc_token)))
  (heredoc_content
    (heredoc_end))
  (expression_statement
    (assignment_expression
      (scalar
        (varname))
      (quoted_regexp
        (regexp_content
          (escape_sequence)
          (escape_sequence)
          (escape_sequence))
        (quoted_regexp_modifiers)))))
