/* automatically generated by rust-bindgen 0.72.0 */

pub type TSStateId = u16;
pub type TSSymbol = u16;
pub type TSFieldId = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSLanguageMetadata {
    pub major_version: u8,
    pub minor_version: u8,
    pub patch_version: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSLanguageMetadata"][::std::mem::size_of::<TSLanguageMetadata>() - 3usize];
    ["Alignment of TSLanguageMetadata"][::std::mem::align_of::<TSLanguageMetadata>() - 1usize];
    ["Offset of field: TSLanguageMetadata::major_version"]
        [::std::mem::offset_of!(TSLanguageMetadata, major_version) - 0usize];
    ["Offset of field: TSLanguageMetadata::minor_version"]
        [::std::mem::offset_of!(TSLanguageMetadata, minor_version) - 1usize];
    ["Offset of field: TSLanguageMetadata::patch_version"]
        [::std::mem::offset_of!(TSLanguageMetadata, patch_version) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSFieldMapEntry {
    pub field_id: TSFieldId,
    pub child_index: u8,
    pub inherited: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSFieldMapEntry"][::std::mem::size_of::<TSFieldMapEntry>() - 4usize];
    ["Alignment of TSFieldMapEntry"][::std::mem::align_of::<TSFieldMapEntry>() - 2usize];
    ["Offset of field: TSFieldMapEntry::field_id"]
        [::std::mem::offset_of!(TSFieldMapEntry, field_id) - 0usize];
    ["Offset of field: TSFieldMapEntry::child_index"]
        [::std::mem::offset_of!(TSFieldMapEntry, child_index) - 2usize];
    ["Offset of field: TSFieldMapEntry::inherited"]
        [::std::mem::offset_of!(TSFieldMapEntry, inherited) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSMapSlice {
    pub index: u16,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSMapSlice"][::std::mem::size_of::<TSMapSlice>() - 4usize];
    ["Alignment of TSMapSlice"][::std::mem::align_of::<TSMapSlice>() - 2usize];
    ["Offset of field: TSMapSlice::index"][::std::mem::offset_of!(TSMapSlice, index) - 0usize];
    ["Offset of field: TSMapSlice::length"][::std::mem::offset_of!(TSMapSlice, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSSymbolMetadata {
    pub visible: bool,
    pub named: bool,
    pub supertype: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSSymbolMetadata"][::std::mem::size_of::<TSSymbolMetadata>() - 3usize];
    ["Alignment of TSSymbolMetadata"][::std::mem::align_of::<TSSymbolMetadata>() - 1usize];
    ["Offset of field: TSSymbolMetadata::visible"]
        [::std::mem::offset_of!(TSSymbolMetadata, visible) - 0usize];
    ["Offset of field: TSSymbolMetadata::named"]
        [::std::mem::offset_of!(TSSymbolMetadata, named) - 1usize];
    ["Offset of field: TSSymbolMetadata::supertype"]
        [::std::mem::offset_of!(TSSymbolMetadata, supertype) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSLexer {
    pub lookahead: i32,
    pub result_symbol: TSSymbol,
    pub advance: ::std::option::Option<unsafe extern "C" fn(arg1: *mut TSLexer, arg2: bool)>,
    pub mark_end: ::std::option::Option<unsafe extern "C" fn(arg1: *mut TSLexer)>,
    pub get_column: ::std::option::Option<unsafe extern "C" fn(arg1: *mut TSLexer) -> u32>,
    pub is_at_included_range_start:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const TSLexer) -> bool>,
    pub eof: ::std::option::Option<unsafe extern "C" fn(arg1: *const TSLexer) -> bool>,
    pub log: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const TSLexer, arg2: *const ::std::os::raw::c_char, ...),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSLexer"][::std::mem::size_of::<TSLexer>() - 56usize];
    ["Alignment of TSLexer"][::std::mem::align_of::<TSLexer>() - 8usize];
    ["Offset of field: TSLexer::lookahead"][::std::mem::offset_of!(TSLexer, lookahead) - 0usize];
    ["Offset of field: TSLexer::result_symbol"]
        [::std::mem::offset_of!(TSLexer, result_symbol) - 4usize];
    ["Offset of field: TSLexer::advance"][::std::mem::offset_of!(TSLexer, advance) - 8usize];
    ["Offset of field: TSLexer::mark_end"][::std::mem::offset_of!(TSLexer, mark_end) - 16usize];
    ["Offset of field: TSLexer::get_column"][::std::mem::offset_of!(TSLexer, get_column) - 24usize];
    ["Offset of field: TSLexer::is_at_included_range_start"]
        [::std::mem::offset_of!(TSLexer, is_at_included_range_start) - 32usize];
    ["Offset of field: TSLexer::eof"][::std::mem::offset_of!(TSLexer, eof) - 40usize];
    ["Offset of field: TSLexer::log"][::std::mem::offset_of!(TSLexer, log) - 48usize];
};
pub const TSParseActionType_TSParseActionTypeShift: TSParseActionType = 0;
pub const TSParseActionType_TSParseActionTypeReduce: TSParseActionType = 1;
pub const TSParseActionType_TSParseActionTypeAccept: TSParseActionType = 2;
pub const TSParseActionType_TSParseActionTypeRecover: TSParseActionType = 3;
pub type TSParseActionType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union TSParseAction {
    pub shift: TSParseAction__bindgen_ty_1,
    pub reduce: TSParseAction__bindgen_ty_2,
    pub type_: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSParseAction__bindgen_ty_1 {
    pub type_: u8,
    pub state: TSStateId,
    pub extra: bool,
    pub repetition: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSParseAction__bindgen_ty_1"]
        [::std::mem::size_of::<TSParseAction__bindgen_ty_1>() - 6usize];
    ["Alignment of TSParseAction__bindgen_ty_1"]
        [::std::mem::align_of::<TSParseAction__bindgen_ty_1>() - 2usize];
    ["Offset of field: TSParseAction__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: TSParseAction__bindgen_ty_1::state"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_1, state) - 2usize];
    ["Offset of field: TSParseAction__bindgen_ty_1::extra"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_1, extra) - 4usize];
    ["Offset of field: TSParseAction__bindgen_ty_1::repetition"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_1, repetition) - 5usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSParseAction__bindgen_ty_2 {
    pub type_: u8,
    pub child_count: u8,
    pub symbol: TSSymbol,
    pub dynamic_precedence: i16,
    pub production_id: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSParseAction__bindgen_ty_2"]
        [::std::mem::size_of::<TSParseAction__bindgen_ty_2>() - 8usize];
    ["Alignment of TSParseAction__bindgen_ty_2"]
        [::std::mem::align_of::<TSParseAction__bindgen_ty_2>() - 2usize];
    ["Offset of field: TSParseAction__bindgen_ty_2::type_"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_2, type_) - 0usize];
    ["Offset of field: TSParseAction__bindgen_ty_2::child_count"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_2, child_count) - 1usize];
    ["Offset of field: TSParseAction__bindgen_ty_2::symbol"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_2, symbol) - 2usize];
    ["Offset of field: TSParseAction__bindgen_ty_2::dynamic_precedence"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_2, dynamic_precedence) - 4usize];
    ["Offset of field: TSParseAction__bindgen_ty_2::production_id"]
        [::std::mem::offset_of!(TSParseAction__bindgen_ty_2, production_id) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSParseAction"][::std::mem::size_of::<TSParseAction>() - 8usize];
    ["Alignment of TSParseAction"][::std::mem::align_of::<TSParseAction>() - 2usize];
    ["Offset of field: TSParseAction::shift"]
        [::std::mem::offset_of!(TSParseAction, shift) - 0usize];
    ["Offset of field: TSParseAction::reduce"]
        [::std::mem::offset_of!(TSParseAction, reduce) - 0usize];
    ["Offset of field: TSParseAction::type_"]
        [::std::mem::offset_of!(TSParseAction, type_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSLexMode {
    pub lex_state: u16,
    pub external_lex_state: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSLexMode"][::std::mem::size_of::<TSLexMode>() - 4usize];
    ["Alignment of TSLexMode"][::std::mem::align_of::<TSLexMode>() - 2usize];
    ["Offset of field: TSLexMode::lex_state"]
        [::std::mem::offset_of!(TSLexMode, lex_state) - 0usize];
    ["Offset of field: TSLexMode::external_lex_state"]
        [::std::mem::offset_of!(TSLexMode, external_lex_state) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSLexerMode {
    pub lex_state: u16,
    pub external_lex_state: u16,
    pub reserved_word_set_id: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSLexerMode"][::std::mem::size_of::<TSLexerMode>() - 6usize];
    ["Alignment of TSLexerMode"][::std::mem::align_of::<TSLexerMode>() - 2usize];
    ["Offset of field: TSLexerMode::lex_state"]
        [::std::mem::offset_of!(TSLexerMode, lex_state) - 0usize];
    ["Offset of field: TSLexerMode::external_lex_state"]
        [::std::mem::offset_of!(TSLexerMode, external_lex_state) - 2usize];
    ["Offset of field: TSLexerMode::reserved_word_set_id"]
        [::std::mem::offset_of!(TSLexerMode, reserved_word_set_id) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union TSParseActionEntry {
    pub action: TSParseAction,
    pub entry: TSParseActionEntry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSParseActionEntry__bindgen_ty_1 {
    pub count: u8,
    pub reusable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSParseActionEntry__bindgen_ty_1"]
        [::std::mem::size_of::<TSParseActionEntry__bindgen_ty_1>() - 2usize];
    ["Alignment of TSParseActionEntry__bindgen_ty_1"]
        [::std::mem::align_of::<TSParseActionEntry__bindgen_ty_1>() - 1usize];
    ["Offset of field: TSParseActionEntry__bindgen_ty_1::count"]
        [::std::mem::offset_of!(TSParseActionEntry__bindgen_ty_1, count) - 0usize];
    ["Offset of field: TSParseActionEntry__bindgen_ty_1::reusable"]
        [::std::mem::offset_of!(TSParseActionEntry__bindgen_ty_1, reusable) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSParseActionEntry"][::std::mem::size_of::<TSParseActionEntry>() - 8usize];
    ["Alignment of TSParseActionEntry"][::std::mem::align_of::<TSParseActionEntry>() - 2usize];
    ["Offset of field: TSParseActionEntry::action"]
        [::std::mem::offset_of!(TSParseActionEntry, action) - 0usize];
    ["Offset of field: TSParseActionEntry::entry"]
        [::std::mem::offset_of!(TSParseActionEntry, entry) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSCharacterRange {
    pub start: i32,
    pub end: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSCharacterRange"][::std::mem::size_of::<TSCharacterRange>() - 8usize];
    ["Alignment of TSCharacterRange"][::std::mem::align_of::<TSCharacterRange>() - 4usize];
    ["Offset of field: TSCharacterRange::start"]
        [::std::mem::offset_of!(TSCharacterRange, start) - 0usize];
    ["Offset of field: TSCharacterRange::end"]
        [::std::mem::offset_of!(TSCharacterRange, end) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSLanguage {
    pub abi_version: u32,
    pub symbol_count: u32,
    pub alias_count: u32,
    pub token_count: u32,
    pub external_token_count: u32,
    pub state_count: u32,
    pub large_state_count: u32,
    pub production_id_count: u32,
    pub field_count: u32,
    pub max_alias_sequence_length: u16,
    pub parse_table: *const u16,
    pub small_parse_table: *const u16,
    pub small_parse_table_map: *const u32,
    pub parse_actions: *const TSParseActionEntry,
    pub symbol_names: *const *const ::std::os::raw::c_char,
    pub field_names: *const *const ::std::os::raw::c_char,
    pub field_map_slices: *const TSMapSlice,
    pub field_map_entries: *const TSFieldMapEntry,
    pub symbol_metadata: *const TSSymbolMetadata,
    pub public_symbol_map: *const TSSymbol,
    pub alias_map: *const u16,
    pub alias_sequences: *const TSSymbol,
    pub lex_modes: *const TSLexerMode,
    pub lex_fn:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut TSLexer, arg2: TSStateId) -> bool>,
    pub keyword_lex_fn:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut TSLexer, arg2: TSStateId) -> bool>,
    pub keyword_capture_token: TSSymbol,
    pub external_scanner: TSLanguage__bindgen_ty_1,
    pub primary_state_ids: *const TSStateId,
    pub name: *const ::std::os::raw::c_char,
    pub reserved_words: *const TSSymbol,
    pub max_reserved_word_set_size: u16,
    pub supertype_count: u32,
    pub supertype_symbols: *const TSSymbol,
    pub supertype_map_slices: *const TSMapSlice,
    pub supertype_map_entries: *const TSSymbol,
    pub metadata: TSLanguageMetadata,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TSLanguage__bindgen_ty_1 {
    pub states: *const bool,
    pub symbol_map: *const TSSymbol,
    pub create: ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub scan: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut TSLexer,
            symbol_whitelist: *const bool,
        ) -> bool,
    >,
    pub serialize: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_uint,
    >,
    pub deserialize: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_uint,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSLanguage__bindgen_ty_1"]
        [::std::mem::size_of::<TSLanguage__bindgen_ty_1>() - 56usize];
    ["Alignment of TSLanguage__bindgen_ty_1"]
        [::std::mem::align_of::<TSLanguage__bindgen_ty_1>() - 8usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::states"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, states) - 0usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::symbol_map"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, symbol_map) - 8usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::create"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, create) - 16usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::destroy"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, destroy) - 24usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::scan"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, scan) - 32usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::serialize"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, serialize) - 40usize];
    ["Offset of field: TSLanguage__bindgen_ty_1::deserialize"]
        [::std::mem::offset_of!(TSLanguage__bindgen_ty_1, deserialize) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TSLanguage"][::std::mem::size_of::<TSLanguage>() - 288usize];
    ["Alignment of TSLanguage"][::std::mem::align_of::<TSLanguage>() - 8usize];
    ["Offset of field: TSLanguage::abi_version"]
        [::std::mem::offset_of!(TSLanguage, abi_version) - 0usize];
    ["Offset of field: TSLanguage::symbol_count"]
        [::std::mem::offset_of!(TSLanguage, symbol_count) - 4usize];
    ["Offset of field: TSLanguage::alias_count"]
        [::std::mem::offset_of!(TSLanguage, alias_count) - 8usize];
    ["Offset of field: TSLanguage::token_count"]
        [::std::mem::offset_of!(TSLanguage, token_count) - 12usize];
    ["Offset of field: TSLanguage::external_token_count"]
        [::std::mem::offset_of!(TSLanguage, external_token_count) - 16usize];
    ["Offset of field: TSLanguage::state_count"]
        [::std::mem::offset_of!(TSLanguage, state_count) - 20usize];
    ["Offset of field: TSLanguage::large_state_count"]
        [::std::mem::offset_of!(TSLanguage, large_state_count) - 24usize];
    ["Offset of field: TSLanguage::production_id_count"]
        [::std::mem::offset_of!(TSLanguage, production_id_count) - 28usize];
    ["Offset of field: TSLanguage::field_count"]
        [::std::mem::offset_of!(TSLanguage, field_count) - 32usize];
    ["Offset of field: TSLanguage::max_alias_sequence_length"]
        [::std::mem::offset_of!(TSLanguage, max_alias_sequence_length) - 36usize];
    ["Offset of field: TSLanguage::parse_table"]
        [::std::mem::offset_of!(TSLanguage, parse_table) - 40usize];
    ["Offset of field: TSLanguage::small_parse_table"]
        [::std::mem::offset_of!(TSLanguage, small_parse_table) - 48usize];
    ["Offset of field: TSLanguage::small_parse_table_map"]
        [::std::mem::offset_of!(TSLanguage, small_parse_table_map) - 56usize];
    ["Offset of field: TSLanguage::parse_actions"]
        [::std::mem::offset_of!(TSLanguage, parse_actions) - 64usize];
    ["Offset of field: TSLanguage::symbol_names"]
        [::std::mem::offset_of!(TSLanguage, symbol_names) - 72usize];
    ["Offset of field: TSLanguage::field_names"]
        [::std::mem::offset_of!(TSLanguage, field_names) - 80usize];
    ["Offset of field: TSLanguage::field_map_slices"]
        [::std::mem::offset_of!(TSLanguage, field_map_slices) - 88usize];
    ["Offset of field: TSLanguage::field_map_entries"]
        [::std::mem::offset_of!(TSLanguage, field_map_entries) - 96usize];
    ["Offset of field: TSLanguage::symbol_metadata"]
        [::std::mem::offset_of!(TSLanguage, symbol_metadata) - 104usize];
    ["Offset of field: TSLanguage::public_symbol_map"]
        [::std::mem::offset_of!(TSLanguage, public_symbol_map) - 112usize];
    ["Offset of field: TSLanguage::alias_map"]
        [::std::mem::offset_of!(TSLanguage, alias_map) - 120usize];
    ["Offset of field: TSLanguage::alias_sequences"]
        [::std::mem::offset_of!(TSLanguage, alias_sequences) - 128usize];
    ["Offset of field: TSLanguage::lex_modes"]
        [::std::mem::offset_of!(TSLanguage, lex_modes) - 136usize];
    ["Offset of field: TSLanguage::lex_fn"][::std::mem::offset_of!(TSLanguage, lex_fn) - 144usize];
    ["Offset of field: TSLanguage::keyword_lex_fn"]
        [::std::mem::offset_of!(TSLanguage, keyword_lex_fn) - 152usize];
    ["Offset of field: TSLanguage::keyword_capture_token"]
        [::std::mem::offset_of!(TSLanguage, keyword_capture_token) - 160usize];
    ["Offset of field: TSLanguage::external_scanner"]
        [::std::mem::offset_of!(TSLanguage, external_scanner) - 168usize];
    ["Offset of field: TSLanguage::primary_state_ids"]
        [::std::mem::offset_of!(TSLanguage, primary_state_ids) - 224usize];
    ["Offset of field: TSLanguage::name"][::std::mem::offset_of!(TSLanguage, name) - 232usize];
    ["Offset of field: TSLanguage::reserved_words"]
        [::std::mem::offset_of!(TSLanguage, reserved_words) - 240usize];
    ["Offset of field: TSLanguage::max_reserved_word_set_size"]
        [::std::mem::offset_of!(TSLanguage, max_reserved_word_set_size) - 248usize];
    ["Offset of field: TSLanguage::supertype_count"]
        [::std::mem::offset_of!(TSLanguage, supertype_count) - 252usize];
    ["Offset of field: TSLanguage::supertype_symbols"]
        [::std::mem::offset_of!(TSLanguage, supertype_symbols) - 256usize];
    ["Offset of field: TSLanguage::supertype_map_slices"]
        [::std::mem::offset_of!(TSLanguage, supertype_map_slices) - 264usize];
    ["Offset of field: TSLanguage::supertype_map_entries"]
        [::std::mem::offset_of!(TSLanguage, supertype_map_entries) - 272usize];
    ["Offset of field: TSLanguage::metadata"]
        [::std::mem::offset_of!(TSLanguage, metadata) - 280usize];
};
